In [1]:
%load_ext sql

In [2]:
%sql mysql+mysqldb://root:admin@localhost/

In [3]:
%%sql
DROP DATABASE IF EXISTS READYHOLS;

 * mysql+mysqldb://root:***@localhost/
17 rows affected.

[]

In [4]:
%%sql
CREATE DATABASE READYHOLS;
USE READYHOLS;

CREATE TABLE user(
    user_id      char(9) not null ,
    username     varchar(30),
    password     varchar(1024),
    email        varchar(30),
    plan_type    char(10),
    sub_mail     boolean,
    share_drive  boolean,
    grp_count    integer,
    upg_count    integer,
    primary key (user_id)
);

CREATE TABLE vacation(
    vac_id       char(9) not null ,
    description  text,
    vac_grp_id   char(9),
    upg_user_id  char(9),
    start_date   date,
    end_date     date,
    budget_limit integer,
    primary key (vac_id),
    foreign key (upg_user_id) references user(user_id) on update cascade on delete cascade
);

CREATE TABLE vacation_grp(
    vac_grp_id   char(9) not null ,
    grp_name     varchar(50),
    vac_grp_pin  varchar(1024),
    primary key (vac_grp_id)
);

CREATE TABLE vac_user_in(
    vac_grp_id   char(9) not null,
    user_id      char(9) not null,
    primary key (vac_grp_id,user_id),
    foreign key (vac_grp_id) references vacation_grp(vac_grp_id) on update cascade on delete cascade,
    foreign key (user_id) references user(user_id) on update cascade on delete cascade
);

CREATE TABLE budget(
    vac_id       char(9) not null,
    budget_id    char(9) not null,
    category     varchar(30),
    expenditure  integer,
    remarks      text,
    primary key (vac_id,budget_id),
    foreign key (vac_id) references vacation(vac_id) on update cascade on delete cascade
);

CREATE TABLE album(
    alb_id       char(9) not null ,
    alb_name     varchar(50),
    alb_date     date,
    vac_id       char(9) not null,
    foreign key (vac_id) references vacation(vac_id) on update cascade on delete cascade,
    primary key (alb_id)
);

CREATE TABLE photo(
    photo_id     char(9) not null ,
    photolink    varchar(1024),
    alb_id       char(9),
    primary key (photo_id),
    foreign key (alb_id) references album(alb_id) on update cascade on delete cascade
);

CREATE TABLE booking(
    vac_id       char(9) not null ,
    ref_no       varchar(30),
    booking_type varchar(30),
    description  text,
    attachment   varchar(1024),
    primary key (vac_id,ref_no),
    foreign key (vac_id) references vacation(vac_id) on update cascade on delete cascade
);

CREATE TABLE itinerary(
    vac_id       char(9) not null ,
    day_no       integer not null,
    itin_time    time not null,
    itin_type    varchar(30),
    description  varchar(100),
    location     varchar(50),
    primary key (vac_id, day_no, itin_time),
    foreign key (vac_id) references vacation(vac_id) on update cascade on delete cascade
);

CREATE TABLE destination(
    dest_id      char(9) not null,
    country      varchar(50),
    state        varchar(50),
    primary key (dest_id)
);

CREATE TABLE has_destination(
    vac_id       char(9) not null,
    dest_id      char(9) not null,
    no_days      integer,
    dstart_date  date,
    primary key (vac_id, dest_id),
    foreign key (vac_id) references vacation(vac_id) on update cascade on delete cascade,
    foreign key (dest_id) references destination(dest_id) on update cascade on delete cascade
);

CREATE TABLE vac_map(
    map_id       char(9) not null ,
    map_link     varchar(1024),
    name         varchar(50),
    category     varchar(30),
    primary key (map_id)
);

CREATE TABLE ref_map_itin(
    vac_id       char(9) not null ,
    itin_time    time not null,
    day_no       integer not null,
    map_id       char(9) not null,
    primary key (vac_id, day_no, itin_time, map_id),
    foreign key (vac_id, day_no, itin_time) references itinerary(vac_id, day_no, itin_time) on update cascade on delete cascade,
    foreign key (map_id) references vac_map(map_id) on update cascade on delete cascade
);


alter table vacation add foreign key(vac_grp_id) references vacation_grp(vac_grp_id) on delete cascade on update cascade;

 * mysql+mysqldb://root:***@localhost/
1 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.

[]

In [5]:
%%sql
grant all privileges on readyhols.* to 'root'@'localhost';
flush privileges;

 * mysql+mysqldb://root:***@localhost/
0 rows affected.
0 rows affected.

[]

In [6]:
from werkzeug.security import check_password_hash, generate_password_hash

(username,password)
(anna,123456)
(benny,abcdef)
(charlie,567890)
(daniel,DANIEL)
(elliot,iLoveCS)
(francis,567890)

In [7]:
generate_password_hash("123456")

'pbkdf2:sha256:260000$sXsei7fBPCL9Dj3k$fddafebb727862691e44af2be66b3236f5f4a642e85997fffb280445f333701e'

In [8]:
generate_password_hash("abcdef")

'pbkdf2:sha256:260000$iXaMvR13sPRZpAUV$ec7ed1f1f2ed2776d5b0ccca47ef7356bd86df95c8124037fd771e7d78586bc5'

In [9]:
generate_password_hash("567890")

'pbkdf2:sha256:260000$kk8MYPhTAnv5NEfp$b962bc9660e2141b20aea2cc6455bd886221055be692172ad703d722a550ef93'

In [10]:
generate_password_hash("DANIEL")

'pbkdf2:sha256:260000$L9ktDxssOmNjvjyF$59f4b27a2c8e7db8e15cd34bd7ed661c518b6c2ab4f7bf13a5d1fdbaf100d6c3'

In [11]:
generate_password_hash("iLoveCS")

'pbkdf2:sha256:260000$VNjdLdlRFUwBfvnp$0130a5a245efb1ee1bc0451e800309a21c0adc1d2e0f7fd29415b44d888e4671'

In [12]:
generate_password_hash("567890")

'pbkdf2:sha256:260000$HaAWX3lTosfdLx1r$4385407f7459a5d73bdcdb69de6e0faef85da7089856b0fc371119173b788271'

In [13]:
%%sql
INSERT INTO user VALUES("000000001","anna",'pbkdf2:sha256:260000$kSM7BXkw2mcP2DcA$a3d4850b380a3909c9635f78e726e56c2f65438b5a889fda17a53031fa1dc4c0',"anna123@nushigh.edu.sg","Basic",false,false,3,0);
INSERT INTO user VALUES("000000002","benny",'pbkdf2:sha256:260000$NzZJ33Zwlk42gfLb$5b5dc951dc89c496420267c31c576cc03ed6a80b71d08479fe0df28637959fc4',"bennyLee@nushigh.edu.sg","Premium",true,false,5,2);
INSERT INTO user VALUES("000000003","charlie",'pbkdf2:sha256:260000$X4sfAwlscYBgijfh$042d68c587b0e117d05fbfde8c62c9cba309c97f82795c2c08ad953823ad3a74',"charlieC@nushigh.edu.sg","Plus",false,true,3,0);
INSERT INTO user VALUES("000000004","daniel",'pbkdf2:sha256:260000$AyTeYmut2uF2rzVo$cd1d3c15f30b45a8dd5369fe6f28c885d0546df61446bd1abfe8f8cc63f7d0bd',"dan_iel@nushigh.edu.sg","Plus",false,true,1,1);
INSERT INTO user VALUES("000000005","elliot",'pbkdf2:sha256:260000$ARjtELf0F9OGIkeb$d2a917a279ca113136ddbee29aa89dcaa0a5d0bdc7ee04b98e5c6a882178c13f',"elliot_@nushigh.edu.sg","Basic",false,true,2,0);
INSERT INTO user VALUES("000000006","francis",'pbkdf2:sha256:260000$uYJ8uGRMnnqUL9TD$5a73e1d82b52ff2ed2c22390a72bf526389508f933d3e9a27b0b21788d985487',"fh123@nushigh.edu.sg","Premium",true,true,1,1);

 * mysql+mysqldb://root:***@localhost/
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [14]:
%%sql

INSERT INTO vacation_grp VALUES("000000001","Lee Family","345677725845");
INSERT INTO vacation_grp VALUES("000000002","Teoh Family","524638776254");
INSERT INTO vacation_grp VALUES("000000003","Tan Family","296729573058");
INSERT INTO vacation_grp VALUES("000000004","CS Major Family","108394827503");
INSERT INTO vacation_grp VALUES("000000005","OSAP TRIP GROUP","104927684838");
INSERT INTO vacation_grp VALUES("000000006","Cluster 12A","234098134099");

INSERT INTO vacation VALUES("000000001","Trip to Malaysia","000000003",null,"2023-02-13","2023-02-16",5000);
INSERT INTO vacation VALUES("000000002","Trip to Japan","000000001","000000002","2023-03-29","2023-04-11",8000);
INSERT INTO vacation VALUES("000000003","Trip to Germany","000000002","000000002","2023-02-26","2023-05-10",10000);
INSERT INTO vacation VALUES("000000004","Trip to USA","000000005","000000006","2023-06-13","2023-06-20",20000);
INSERT INTO vacation VALUES("000000005","Trip to Switzerland","000000005","000000004","2023-06-02","2023-06-20",25000);
INSERT INTO vacation VALUES("000000006","Trip to Australia","000000004",null,"2023-05-01","2023-05-30",50000);

INSERT INTO vac_user_in VALUES("000000001","000000002");
INSERT INTO vac_user_in VALUES("000000001","000000003");
INSERT INTO vac_user_in VALUES("000000001","000000005");
INSERT INTO vac_user_in VALUES("000000002","000000002");
INSERT INTO vac_user_in VALUES("000000003","000000001");
INSERT INTO vac_user_in VALUES("000000003","000000002");
INSERT INTO vac_user_in VALUES("000000004","000000001");
INSERT INTO vac_user_in VALUES("000000004","000000003");
INSERT INTO vac_user_in VALUES("000000004","000000006");
INSERT INTO vac_user_in VALUES("000000005","000000001");
INSERT INTO vac_user_in VALUES("000000005","000000002");
INSERT INTO vac_user_in VALUES("000000005","000000003");
INSERT INTO vac_user_in VALUES("000000005","000000004");
INSERT INTO vac_user_in VALUES("000000005","000000005");
INSERT INTO vac_user_in VALUES("000000006","000000002");

INSERT INTO budget VALUES("000000001","000000001","FOOD",1000,"Italian Restaurant LeFeu");
INSERT INTO budget VALUES("000000001","000000002","FOOD",500,"Japanese Omurice");
INSERT INTO budget VALUES("000000002","000000001","ATTRACTION",8000,"Universal Studios Malaysia");
INSERT INTO budget VALUES("000000002","000000002","OTHERS",5000,"Shopping Expenses");
INSERT INTO budget VALUES("000000002","000000003","FOOD",2000,"Seafood Restaurant");
INSERT INTO budget VALUES("000000003","000000001","TRANSPORT",200,"Concession Card Fees");
INSERT INTO budget VALUES("000000004","000000001","FOOD",10000,"Din Tai Fung Day 3");
INSERT INTO budget VALUES("000000005","000000001","FOOD",300,"Macdonalds");
INSERT INTO budget VALUES("000000006","000000001","FOOD",600,"Chinese Restaurant");

INSERT INTO album VALUES("000000001","Memories of Japan Part 1","2023-04-10","000000002");
INSERT INTO album VALUES("000000002","Memories of Japan Part 2","2023-04-15","000000002");
INSERT INTO album VALUES("000000003","Memories of Germany","2023-02-25","000000003");
INSERT INTO album VALUES("000000004","Memories of USA","2023-06-20","000000004");
INSERT INTO album VALUES("000000005","Memories of Switzerland Part 1","2023-06-23","000000005");
INSERT INTO album VALUES("000000006","Memories of Switzerland Part 2","2023-06-25","000000005");

INSERT INTO photo VALUES("000000001","/pictures/picture1.png","000000002");
INSERT INTO photo VALUES("000000002","/pictures/picture2.png","000000005");
INSERT INTO photo VALUES("000000003","/pictures/picture3.jpg","000000003");
INSERT INTO photo VALUES("000000004","/pictures/picture4.jpg","000000003");
INSERT INTO photo VALUES("000000005","/pictures/picture5.jpg","000000002");
INSERT INTO photo VALUES("000000006","/pictures/picture6.jpg",null);

INSERT INTO booking VALUES("000000001","20957134LAS","TRANSPORT","air ticket to malaysia","/booking-attachment/20957134LAS.pdf");
INSERT INTO booking VALUES("000000002","57186275DGA","FOOD","reservation for restaurant","/booking-attachment/57186275DGA.pdf");
INSERT INTO booking VALUES("000000003","56246593GLK","INSURANCE","basic insurance","/booking-attachment/56246593GLK.pdf");
INSERT INTO booking VALUES("000000004","05782485KXN","ATTRACTION","premium tickets to museum","/booking-attachment/05782485KXN.pdf");
INSERT INTO booking VALUES("000000005","09562434MAS","TRANSPORT","air ticket to switzerland","/booking-attachment/09562434MAS.pdf");
INSERT INTO booking VALUES("000000006","23409845KFS","TRANSPORT","air ticket to australia","/booking-attachment/23409845KFS.pdf");

INSERT INTO itinerary VALUES("000000001",1,"09:00:00","ATTRACTION","penang street","George Town");
INSERT INTO itinerary VALUES("000000001",1,"12:00:00","FOOD","penang street food","Penang Street 1");
INSERT INTO itinerary VALUES("000000001",2,"08:00:00","TOUR","malaysia heritage tour","Penang Street 5");
INSERT INTO itinerary VALUES("000000005",1,"14:00:00","SIGHTSEEING","penang street","Penang Street");
INSERT INTO itinerary VALUES("000000005",1,"18:00:00","TOUR","CERN Site Tour","CERN");
INSERT INTO itinerary VALUES("000000003",1,"09:00:00","FOOD","Christmas market food","Braubachstra√üe");
INSERT INTO itinerary VALUES("000000003",1,"11:00:00","OTHERS","Shopping","Rewe Gottingen");

INSERT INTO destination VALUES("000000001","Malaysia","Penang");
INSERT INTO destination VALUES("000000002","Japan","Tokyo");
INSERT INTO destination VALUES("000000003","Japan","Hokkaido");
INSERT INTO destination VALUES("000000004","Germany","Gottingen");
INSERT INTO destination VALUES("000000005","USA","California");
INSERT INTO destination VALUES("000000006","Switzerland","Bern");
INSERT INTO destination VALUES("000000007","Australia","Tasmania");

INSERT INTO has_destination VALUES("000000001","000000001",4,"2023-02-13");
INSERT INTO has_destination VALUES("000000002","000000002",2,"2023-03-31");
INSERT INTO has_destination VALUES("000000002","000000003",3,"2023-04-07");
INSERT INTO has_destination VALUES("000000003","000000004",14,"2023-02-28");
INSERT INTO has_destination VALUES("000000004","000000005",2,"2023-06-15");
INSERT INTO has_destination VALUES("000000005","000000006",2,"2023-06-02");
INSERT INTO has_destination VALUES("000000006","000000007",10,"2023-05-01");

INSERT INTO vac_map VALUES("000000001","/map-attachment/map-penang.pdf","Map of Penang","GENERAL");
INSERT INTO vac_map VALUES("000000002","/map-attachment/map-japan-mrt.pdf","Map of Japan MRT Lines","TRANSPORT");
INSERT INTO vac_map VALUES("000000003","/map-attachment/map-gemany-rewe.pdf","Map of Germany Shopping Mall Rewe","OTHERS");
INSERT INTO vac_map VALUES("000000004","/map-attachment/map-usa-california.pdf","Map of USA State California","GENERAL");
INSERT INTO vac_map VALUES("000000005","/map-attachment/map-switz-museum.pdf","Map of Switzerland Museum","ATTRACTION");
INSERT INTO vac_map VALUES("000000006","/map-attachment/map-aus-tasmania.pdf","Terrain Guide of Australia Tasmania","OTHERS");
INSERT INTO vac_map VALUES("000000007","/map-attachment/map-christmas-market.pdf","Christmas Market Highlights","OTHERS");
INSERT INTO vac_map VALUES("000000008","/map-attachment/map-panang-recommend.pdf","Penang Street Recommended Locations","ATTRACTION");
INSERT INTO vac_map VALUES("000000009","/map-attachment/map-cern.pdf","CERN Building","OTHERS");
INSERT INTO vac_map VALUES("000000010","/map-attachment/map-german-bus.pdf","Germany Bus Timings","TRANSPORT");

INSERT INTO ref_map_itin VALUES("000000001","09:00:00",1,"000000001");
INSERT INTO ref_map_itin VALUES("000000003","11:00:00",1,"000000003");
INSERT INTO ref_map_itin VALUES("000000003","09:00:00",1,"000000007");
INSERT INTO ref_map_itin VALUES("000000001","12:00:00",1,"000000008");
INSERT INTO ref_map_itin VALUES("000000005","18:00:00",1,"000000009");
INSERT INTO ref_map_itin VALUES("000000003","09:00:00",1,"000000010");
INSERT INTO ref_map_itin VALUES("000000003","11:00:00",1,"000000010");

 * mysql+mysqldb://root:***@localhost/
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [15]:
%%sql

Create view vacation_summary as

(select destination_summary_tbl.vac_id, start_date, end_date, first_state, first_country, last_state, last_country, 
datediff(end_date,start_date) as days, budget_limit, total_spend, remaining_budget from 

(select start_destination_tbl.vac_id, first_state, first_country, last_state, last_country from
(select vac_id,state as first_state,country as first_country from destination d1, has_destination hd1
where dstart_date <= all (select dstart_date from has_destination hd2, destination d2
where hd2.vac_id = hd1.vac_id and hd2.dest_id = d2.dest_id) and hd1.dest_id = d1.dest_id) as start_destination_tbl

join 

(select vac_id,state as last_state,country as last_country from destination d3, has_destination hd3
where dstart_date >= all (select dstart_date from has_destination hd4, destination d4 
where hd4.vac_id = hd3.vac_id and hd4.dest_id = d4.dest_id) and d3.dest_id = hd3.dest_id) as end_destination_tbl

on start_destination_tbl.vac_id = end_destination_tbl.vac_id) as destination_summary_tbl

join 

(select start_end_vac.vac_id, start_date, end_date, days, budget_limit, total_spend, remaining_budget from
(select vac_id, start_date, end_date, datediff(end_date,start_date) as days from vacation) as start_end_vac

join

(select vacation.vac_id,budget_limit, sum(expenditure) as total_spend, budget_limit-sum(expenditure) as remaining_budget 
 from vacation, budget where vacation.vac_id = budget.vac_id
group by vacation.vac_id) as expense_tbl

on start_end_vac.vac_id = expense_tbl.vac_id) as expenditure_summary_tbl

on expenditure_summary_tbl.vac_id = destination_summary_tbl.vac_id)

 * mysql+mysqldb://root:***@localhost/
0 rows affected.

[]

In [16]:
%%sql
Create view vac_user_has as
select user.user_id,vacation.vac_id from user,vacation,vac_user_in
where user.user_id = vac_user_in.user_id and vac_user_in.vac_grp_id = vacation.vac_grp_id;
select * from vac_user_has

 * mysql+mysqldb://root:***@localhost/
0 rows affected.
19 rows affected.

[('000000002', '000000002'),
 ('000000003', '000000002'),
 ('000000005', '000000002'),
 ('000000002', '000000003'),
 ('000000001', '000000001'),
 ('000000002', '000000001'),
 ('000000001', '000000006'),
 ('000000003', '000000006'),
 ('000000006', '000000006'),
 ('000000001', '000000004'),
 ('000000002', '000000004'),
 ('000000003', '000000004'),
 ('000000004', '000000004'),
 ('000000005', '000000004'),
 ('000000001', '000000005'),
 ('000000002', '000000005'),
 ('000000003', '000000005'),
 ('000000004', '000000005'),
 ('000000005', '000000005')]

In [17]:
%%sql
select vacation.vac_id,description,start_date from vacation,vac_user_has
where vacation.vac_id = vac_user_has.vac_id and vac_user_has.user_id = "000000001"

 * mysql+mysqldb://root:***@localhost/
4 rows affected.

[('000000001', 'Trip to Malaysia', datetime.date(2023, 2, 13)),
 ('000000006', 'Trip to Australia', datetime.date(2023, 5, 1)),
 ('000000004', 'Trip to USA', datetime.date(2023, 6, 13)),
 ('000000005', 'Trip to Switzerland', datetime.date(2023, 6, 2))]

In [18]:
%%sql
#album photos table

Create view user_photos as

(select vac_user_has.user_id, vac_user_has.vac_id, photo.photo_id from photo, album, vac_user_has
where album.vac_id = vac_user_has.vac_id and photo.alb_id = album.alb_id)

union

#public photos_table
(select null as user_id, null as vac_id, photo_id from photo where photo.alb_id is null)

 * mysql+mysqldb://root:***@localhost/
0 rows affected.

[]

#### Query 3

In [19]:
%%sql    
select *, date_add(dstart_date, interval (no_days-1) day) dend_date from has_destination, destination
where destination.dest_id = has_destination.dest_id

 * mysql+mysqldb://root:***@localhost/
7 rows affected.

[('000000001', '000000001', 4, datetime.date(2023, 2, 13), '000000001', 'Malaysia', 'Penang', datetime.date(2023, 2, 16)),
 ('000000002', '000000002', 2, datetime.date(2023, 3, 31), '000000002', 'Japan', 'Tokyo', datetime.date(2023, 4, 1)),
 ('000000002', '000000003', 3, datetime.date(2023, 4, 7), '000000003', 'Japan', 'Hokkaido', datetime.date(2023, 4, 9)),
 ('000000003', '000000004', 14, datetime.date(2023, 2, 28), '000000004', 'Germany', 'Gottingen', datetime.date(2023, 3, 13)),
 ('000000004', '000000005', 2, datetime.date(2023, 6, 15), '000000005', 'USA', 'California', datetime.date(2023, 6, 16)),
 ('000000005', '000000006', 2, datetime.date(2023, 6, 2), '000000006', 'Switzerland', 'Bern', datetime.date(2023, 6, 3)),
 ('000000006', '000000007', 10, datetime.date(2023, 5, 1), '000000007', 'Australia', 'Tasmania', datetime.date(2023, 5, 10))]

In [20]:
%%sql

Create view vacation_itinerary as

select sub_timeline_tbl.vac_id, itin_date, itin_time, itin_type, description, location, country, state from 
(select itinerary.vac_id, day_no, itin_time, itin_type, description, location,
date_add(start_date, interval (day_no-1) day) as itin_date from 

itinerary

join 

(select vac_id, start_date from vacation) as vacation_tbl

on itinerary.vac_id = vacation_tbl.vac_id) as sub_timeline_tbl

left join

(select vac_id, has_destination.dest_id, no_days, dstart_date, country, state, 
 date_add(dstart_date, interval (no_days-1) day) dend_date from has_destination, destination
where destination.dest_id = has_destination.dest_id) as destination_tbl

on sub_timeline_tbl.vac_id = destination_tbl.vac_id and 
(sub_timeline_tbl.itin_date >= dstart_date and sub_timeline_tbl.itin_date <=dend_date)

 * mysql+mysqldb://root:***@localhost/
0 rows affected.

[]

In [21]:
%%sql
create trigger insert_vacation
after insert on vacation
for each row update user 
set upg_count = upg_count + 1
where user_id = new.upg_user_id
;

 * mysql+mysqldb://root:***@localhost/
0 rows affected.

[]

In [22]:
%%sql
create trigger update_vacation
after update on vacation
for each row 
update user 
set upg_count = upg_count + 1
where (((old.upg_user_id <> new.upg_user_id) or (old.upg_user_id is null)) and (user_id = new.upg_user_id));

 * mysql+mysqldb://root:***@localhost/
0 rows affected.

[]

In [23]:
%%sql
create trigger insert_vac_grp
after insert on vac_user_in
for each row 
update user 
set grp_count = grp_count + 1
where (user_id = new.user_id);

 * mysql+mysqldb://root:***@localhost/
0 rows affected.

[]

In [29]:
%%sql
select * from budget

 * mysql+mysqldb://root:***@localhost/
9 rows affected.

[('000000001', '000000001', 'FOOD', 1000, 'Italian Restaurant LeFeu'),
 ('000000001', '000000002', 'FOOD', 500, 'Japanese Omurice'),
 ('000000002', '000000001', 'ATTRACTION', 8000, 'Universal Studios Malaysia'),
 ('000000002', '000000002', 'OTHERS', 5000, 'Shopping Expenses'),
 ('000000002', '000000003', 'FOOD', 2000, 'Seafood Restaurant'),
 ('000000003', '000000001', 'TRANSPORT', 200, 'Concession Card Fees'),
 ('000000004', '000000001', 'FOOD', 10000, 'Din Tai Fung Day 3'),
 ('000000005', '000000001', 'FOOD', 300, 'Macdonalds'),
 ('000000006', '000000001', 'FOOD', 600, 'Chinese Restaurant')]

In [25]:
%%sql
SELECT * from vacation_summary where vac_id

 * mysql+mysqldb://root:***@localhost/
6 rows affected.

[('000000001', datetime.date(2023, 2, 13), datetime.date(2023, 2, 16), 'Penang', 'Malaysia', 'Penang', 'Malaysia', 3, 5000, Decimal('1500'), Decimal('3500')),
 ('000000002', datetime.date(2023, 3, 29), datetime.date(2023, 4, 11), 'Tokyo', 'Japan', 'Hokkaido', 'Japan', 13, 8000, Decimal('15000'), Decimal('-7000')),
 ('000000003', datetime.date(2023, 2, 26), datetime.date(2023, 5, 10), 'Gottingen', 'Germany', 'Gottingen', 'Germany', 73, 10000, Decimal('200'), Decimal('9800')),
 ('000000004', datetime.date(2023, 6, 13), datetime.date(2023, 6, 20), 'California', 'USA', 'California', 'USA', 7, 20000, Decimal('10000'), Decimal('10000')),
 ('000000005', datetime.date(2023, 6, 2), datetime.date(2023, 6, 20), 'Bern', 'Switzerland', 'Bern', 'Switzerland', 18, 25000, Decimal('300'), Decimal('24700')),
 ('000000006', datetime.date(2023, 5, 1), datetime.date(2023, 5, 30), 'Tasmania', 'Australia', 'Tasmania', 'Australia', 29, 50000, Decimal('600'), Decimal('49400'))]

queries to be done:

get everyone's username in same vacation group as user

planning table view